In [2]:
import pandas as pd
import numpy as np

In [3]:
import pandas as pd
import numpy as np

data = {
    "Student": ["A", "B", "C", "D", "E"],
    "Math": [85, 90, np.nan, 70, 88],
    "Physics": [np.nan, 92, 75, 80, np.nan],
    "Chemistry": [78, np.nan, 82, 76, 85],
    "Attendance": [90, 85, np.nan, 95, 88]
}

df = pd.DataFrame(data)
print(df)

  Student  Math  Physics  Chemistry  Attendance
0       A  85.0      NaN       78.0        90.0
1       B  90.0     92.0        NaN        85.0
2       C   NaN     75.0       82.0         NaN
3       D  70.0     80.0       76.0        95.0
4       E  88.0      NaN       85.0        88.0

In [5]:
df.to_csv("random.csv",index=False)

In [27]:
df=pd.read_csv("random.csv",nrows=2)
df

  Student  Math  Physics  Chemistry  Attendance
0       A  85.0      NaN       78.0        90.0
1       B  90.0     92.0        NaN        85.0

In [32]:
data=pd.read_csv("random.csv",usecols=['Student','Math'])
data=pd.read_csv("random.csv",usecols=[0,1])

data

  Student  Math
0       A  85.0
1       B  90.0
2       C   NaN
3       D  70.0
4       E  88.0

In [31]:
df=pd.read_csv("random.csv",index_col="Math")
df

     Student  Physics  Chemistry  Attendance
Math
85.0       A      NaN       78.0        90.0
90.0       B     92.0        NaN        85.0
NaN        C     75.0       82.0         NaN
70.0       D     80.0       76.0        95.0
88.0       E      NaN       85.0        88.0

In [41]:
data=pd.read_csv("random.csv",skiprows=[1])
data

  Student  Math  Physics  Chemistry  Attendance
0       B  90.0     92.0        NaN        85.0
1       C   NaN     75.0       82.0         NaN
2       D  70.0     80.0       76.0        95.0
3       E  88.0      NaN       85.0        88.0

In [8]:
df=pd.read_csv("random.csv",header=[0])
df

  Student  Math  Physics  Chemistry  Attendance
0       A  85.0      NaN       78.0        90.0
1       B  90.0     92.0        NaN        85.0
2       C   NaN     75.0       82.0         NaN
3       D  70.0     80.0       76.0        95.0
4       E  88.0      NaN       85.0        88.0

In [39]:
df=pd.read_csv("random.csv",names=["ABC"])
df

                                       ABC
Student Math Physics Chemistry  Attendance
A       85.0 NaN     78.0             90.0
B       90.0 92.0    NaN              85.0
C       NaN  75.0    82.0              NaN
D       70.0 80.0    76.0             95.0
E       88.0 NaN     85.0             88.0

In [ ]:
df=pd.read_csv("random.csv",header=None, prefix='A')
df

In [48]:
df=pd.read_csv("random.csv",dtype={"Math":"float"})
df

  Student  Math  Physics  Chemistry  Attendance
0       A  85.0      NaN       78.0        90.0
1       B  90.0     92.0        NaN        85.0
2       C   NaN     75.0       82.0         NaN
3       D  70.0     80.0       76.0        95.0
4       E  88.0      NaN       85.0        88.0